@echo off
 
REM --------------------------------------------
REM 引数が必要
REM 引数が相対パスでもフルパスに変換
REM %~d1 - %1 をドライブ文字だけに展開
REM %~p1 - %1 をパスだけに展開
REM %~n1 - %1 をファイル名だけに展開
REM %~x1 - %1 をファイル拡張子だけに展開
REM --------------------------------------------
if "%~dpnx1" equ "" goto :eof
 
REM --------------------------------------------
REM 環境変数のローカル化開始
REM --------------------------------------------
setlocal
 
REM --------------------------------------------
REM 一時的に使うexeのファイル名を作る
REM --------------------------------------------
REM 日付と時間を使う、dateの前4桁（YYYY）を削除、timeの:を削除
set tempfile=%date:~4%%time::=%
REM / を削除
set tempfile=%tempfile:/=%
REM . を削除
set tempfile=%tempfile:.=%
REM 空白を削除
set tempfile=%tempfile: =%
 
 
REM --------------------------------------------
REM コンパイル実行（gcc）
REM --------------------------------------------
gcc -o %tempfile%.exe "%~dpnx1"
 
REM --------------------------------------------
REM EXEファイル実行
REM --------------------------------------------
%tempfile%.exe
 
 
REM --------------------------------------------
REM EXEファイル削除
REM --------------------------------------------
del %tempfile%.exe
 
REM --------------------------------------------
REM 環境変数のローカル化終了
REM --------------------------------------------
endlocal
